#var 15

# Задача 1.1
print("Zadacha 1.1")

w = 65 / 100        # %
c_n = 5 / 100       # %
d = 33 / 10**6      # 33 мкм = м
t = 20              #C
ro = 2711           # кг/м3
G_n = 80            #т/год

ro_c = 998          # кг/м3 при 20 С
g = 9.81
u_c = 1/1000        # Па * с

w_os = (d*d * (ro - ro_c) * g) / (18 * u_c)
print("Швидкість остадження w_os:", w_os)


w1_os = w_os / 2
print("Дійсна швидкість остадження w1_os:", w1_os)

c_k = 1 - w
F = G_n * (1 - c_n/c_k) / (3.6 * ro_c * w1_os)
print("Площа відстійника F:", F)


D = (F/0.785)**0.5
print("Діаметр відстійника D:", D)


print()
print()


# Задача 1.2
print("Zadacha 1.2")

T_z = 19            # год
D = 12              # m
M = 22.4            #
delta_tv = 2.4
n = 1.6

delta_c = delta_tv * (n+1) / (delta_tv * n + 1)
print("Масова концентрація твердої фази в зоні згущення delta_c:", delta_c)

x = 1 / (1 + n)
print("Масова концентрація твердої фази в зоні згущення x:", x, "кг тверд фази / кг суспензії")

ro = 1000
T = delta_c * x * ro
print("1 м3 згущеної суспензії містить твердої фази T:", T)

G = M / (0.785 * D * D)
G_h = G * 1000 / 24
print("за добу на 1 м2 осаджується твердої фази G:", G, "m/м^2 *доба")
print("за годину на 1 м2 осаджується твердої фази G:", G_h, "кг/м^2 *год")

h2 = G_h * T_z / T
print("Висота зони згущення (розмірність) h2:", h2)

h1 = 0.508        # Висота зони живлення приймається 0,45 - 0,75 м

h3 = 0.146 * D / 2
print("Висота зони відстійника, в якій обертаються гребки h3:", h3)

H = h1 + h2 + h3
print("Загальна висота відстійника:", H)


print()
print()


# Задача 1.3
print("Zadacha 1.3")

t = 104         # C
d = 60 / 10**6  # 60 мкм
G = 2088        # кг/год
delta_p_to_ro_g = 745
huita = 165

w_u = ( delta_p_to_ro_g * 2 / huita)**0.5
print("Умовна швидкість газу в циліндричній частині циклона w_u:", w_u)

ro_g = 1.293 * 273 / (273 + t)
print("Густина повітря ro_g:", ro_g)


G = G/3600
print("G =", G)

V = G / ro_g
print("V:", V)


D = (V / (0.785 * w_u))**0.5
print("Діаметр циклона D:", D)

delta_p_u = huita * ro_g * w_u * w_u / 2
print("Гідравлічний опір циклона delta_p_u:", delta_p_u)