dxs = (25, 2)
D = 0.8             #m
F = 271             #m2
V1 = 0.03           #m2/s
V2 = 0.013          #m2/s
t1n = 92
t1k = 63
t2n = 41
t2k = 68


"1) За таблицею 1 уточнюємо основні характеристики теплообмінника:"


N = 385                     #загальна кількість труб
L = 9                       #габаритні розміри труб
n = 6                       #число ходів по трубному простору


"2) За визначальною температурою теплоносія встановлюємо значення"
"густини та в’язкості та інших теплофізичних параметрів за необхідності."


ro1 = 973.5
half_life_h1 = 0.67325
mu1 = 367.75 * 10**-6
v1 = 0.3775 * 10**-6
c1 = 4190
Pr1 = 2.295

ro2 = 875.625
# half_life_h2 = 0.649
# mu2 = 513.45 * 10**-6
v2 = 152.2 * 10**-6
# c2 = 4180
Pr2 = 1771


"3) Встановлюємо режим руху теплоносіїв:"

    # внутрішній простір
# l1 = (dxs[0] - 2*dxs[1]) /1000
l1 = (dxs[0]) /1000
s1 = 0.022
w1 = V1 / s1
Re1 = w1*l1/v1

    # міжтрубний простір
d = (dxs[0] + 2*dxs[1]) /1000
l2 = (D**2 - N*d**2) / (D+N*d)
s2 = 0.065
w2 = V2 / s2
Re2 = w2*l2/v2

print("Re1:", Re1)
print("Re2:", Re2)


print()
"4) Визначаємо гідравлічний опір за формулою, яка...:"

# внутрішній простір
suma_z1 = 1.5 + 1.5 + 2.5*5 + 1 + 1
half_life_z1 = 0.014+(1.056/Re1**0.42)                  #коеф тертя


# міжтрубний простір
suma_z2 = 1.5 + 1.5 + 1 + 1
half_life_z2 = 64/Re2

delta_p1 = (half_life_z1 * n * L / l1 + suma_z1) * ro1 * w1**2 / 2
delta_p2 = (half_life_z2 * 1 * L / l2 + suma_z2) * ro2 * w2**2 / 2

print("lambda1:", half_life_z1)
print("lambda2:", half_life_z2)
print("deltaP11", delta_p1)
print("deltaP12", delta_p2)


print()
"5) При розрахунку результуючої втрати напору необхідно:"

t_ser = (t1k+t1n+t2k+t2n)/4


Pr_st1 = 2.722
f1 = (Pr_st1/Pr1)**(1/3)

Pr_st2 = 1043
f_2 = (Pr_st2/Pr2)**(1/3)

g = 9.81
B = (8.95 - 6*(8.95-9.03)/10) / 10000
delta_t = t_ser - (t2n+t2k)/2
Gr = g * l2**3 * B * delta_t / v2**2
f2 = f_2 * (1+0.22 * (Gr*Pr2/Re2)**0.15)

print("f1", f1)
print("f2", f2)

print()
print("P1", delta_p1*f1)
print("P2", delta_p2*f2)


print()
print()
print()
print(l2)

print(Gr)