"ДАНО:"
P = 0.03 * 10**6   #Па
t_start = 40        #C
#KNO3
x_end = 48/100      #%
G = 30000
x_start = 14/100    #%
P_rn = 0.6 * 10**6  #Па
fi = 3/100          #%


''''''''''''''''''''''''"ПУНКТ 2"''''''''''''''''''''''''

P_atm = P/101300
print("P_atm:", P_atm)

t0 = 59.7 - ((P_atm - 0.2)*(59.7-68.7)/0.1)
t0 = 68.4       #ATTENTION
print("!!! t0: ", t0)


delta_t = 1.1           #Деталь Т гс
t1 = t0 + delta_t
print("!!! t1: ", t1)
print()


''''''''''''''''''''''''"ПУНКТ 3"''''''''''''''''''''''''

P1_atm = 0.2550 - ((t1 - 65)*(0.2550-0.3177)/5)         #Інтерполяція для знаходження Р1
P1 = P1_atm * 101300
print("Тиск P1 в atm:", P1_atm)
print("Тиск P1 в МПа:", P1/10**6)


#Інтерполяція К
K = 0.81 - ((P1/10**6 - 0.03)*(0.81-0.85)/0.01)
print("K:", K)

#Інтерполяція delta_ATM
delta_ATM = 5.2 - ((x_end - 0.45)*(5.2-6.1)/0.05)        #ДЛЯ x_end = 48%

print("delta_ATM:", delta_ATM)

delta_t_depr = K * delta_ATM                     #Температурна депресія
t_end = t1 + delta_t_depr                         #Т кінцеве


print()
print("delta_t_depr:", delta_t_depr)
print("!!! t_end:", t_end)
print()


''''''''''''''''''''''''"ПУНКТ 4"''''''''''''''''''''''''

#Тут треба написати, що приймаємо умови для 20 градусів, як це пише в протоколі
#При відсутності даних для tкип, можна прийняти (Ro_p - Ro_v)t_kyp = (Ro_p - Ro_v)20 градусів

#Інтерполяцію робимо по кінцевій концентрації

#KNO3
# Ro_p = "Нема значення в таблиці" - ((x_end - 0.4)*("Нема значення в таблиці"-"Нема значення в таблиці")/0.1)     #Густина розчину кінцевої концентраціїпри при температурі кипіння
Ro_v = 998                                       #Густина води при температурі кипіння (насправді при 20 градусів через спрощення)
H_tr = 4                                         #Робоча висота труб (3 або 4м)

Ro_p = 1162 + (1162-1133) * (48-24)/4            #Тупа інтерполяція, коли виходить за межі
H_lvl = (0.26+0.0014*(Ro_p-Ro_v))*H_tr           #Оптимальна висота рівня по водомірному склу

print("Ro_p:", Ro_p)

#ЦЕЙ ТРЕШ Я ЗАГУБИВ
Ro_v_t_typ = 978 - (t_end - 70)*(978-972)/10
Ro_p = Ro_p - Ro_v + Ro_v_t_typ

print("Густина води при Т кін:", Ro_v_t_typ)
print("Ro_p2:", Ro_p)

g = 9.81
P_ser = P1 + 0.5 * Ro_p * g * H_lvl       #P середнє для розрахунку t середнього по таблиці
P_ser_atm = P_ser/101300

print("H_lvl:", H_lvl)
print("P ser Па:", P_ser)
print("P ser atm:", P_ser_atm, "- з ньоого шукаю t_ser")

t_ser = 75.4 - ((P_ser_atm - 0.4)*(75.3-80.9)/0.1)    #Температура кип води при тиску P_ser

delta_t_g_ef = t_ser - t1           #Гідростатична депресія
t_kyp = t_end + delta_t_g_ef        #Середня температура кипіння розчину в трубах

print("!!! t_ser: ", t_ser)
print()
print("delta_t_g_ef:", delta_t_g_ef)
print("!!! t_kyp: ", t_kyp)


''''''''''''''''''''''''"ПУНКТ 5"''''''''''''''''''''''''

#Температура пари, що гріє. Знаходимо, як і t0 по значенню тиску з дано
P_rn_atm = P_rn/101300
print("P_rn_atm:", P_rn_atm)


t_rn = 151.1 - ((P_rn_atm - 5)*(151.1-158.1)/1)
t_rn = 157.6      #ATTENTION
print("!!! t_rn: ", t_rn)
print()


delta_t_zag = t_rn - t0            #Загальна різниця температур
print("Загальна різниця температур:", delta_t_zag)

delta_t_kor = t_rn - t_kyp            #Корисна різниця температур
print("Корисна різниця температур:", delta_t_kor)
print()



'''''"ПУНКТ 6 ПЕРЕНІС ВНИЗ ПІСЛЯ АЖ В КІНЕЦЬ РОБОТИ"'''''
''''''''''''''''''''''''"ПУНКТ 7"''''''''''''''''''''''''

#Кількість води, що випаровується
W = G * (1 - (x_start/x_end))
print("W:", W)
print()


''''''''''''''''''''''''"ПУНКТ 8"''''''''''''''''''''''''

#Кількість теплоти, переданої від пари, що гріє до киплячого розчину

cp_start = 4190*(1-(x_start))
cp_v = 4190

i_vp = 2617.5 - ((t1 - 65)*(2617.5-2626.3)/5)
i_vp = i_vp * 1000

Q_vt = 1.05         #В дано у всіх Теплові втрати прийняти 5%

Q_rn = (G * cp_start * (t_end - t_start) + W *(i_vp - cp_v*t_end) ) * Q_vt

print("i_vp:", i_vp)
print("cp_start:", cp_start)
print("cp_v:", cp_v)

print()
print("Q_rn:", Q_rn/10**10, "* 10^10")
print()


''''''''''''''''''''''''"ПУНКТ 9"''''''''''''''''''''''''

r = 2120 - ((t_rn - 150)*(2120-2089)/10)
r = r * 1000

print("r:", r, "Дж/кг")

x = (1 - fi)
G_rn = Q_rn / (r * x)

print("G_rn:", G_rn)
print()


''''''''''''''''''''''''"ПУНКТ 10"''''''''''''''''''''''''

d = G_rn / W
print("d:", d)
print()


''''''''''''''''''''''''"ПУНКТ 11"''''''''''''''''''''''''

''''''''''''''''''''''"ПІДПУНКТ 1"'''''''''''''''''''''''


#ІНТЕРПОЛЮЄМО ВСІ ЗНАЧЕННЯ ПРИ t_rn = 157.6 для ВОДИ
print("ІНТЕРПОЛЯЦІЯ ПРИВІТ:    (для води)")

half_life_z = 68.4 - (t_rn - 150) * (68.4 - 68.3) / 10
half_life_z = half_life_z / 100
print("half_life_z:", half_life_z, "Вт/(м*К)")


Ro_z = 917 - (t_rn - 150) * (917 - 907) / 10
print("Ro_z:", Ro_z, "кг/м3")


r_z = 2120 - (t_rn - 150) * (2120 - 2089) / 10
r_z = r_z * 1000
print("r_z:", r_z, "Дж/кг")


u_z = 185 - (t_rn - 150) * (185 - 174) / 10
u_z = u_z * 10**-6
print("u_z:", u_z, "Па*с")

print("Тоді нарешті:")
A = 1.21 * half_life_z * ((Ro_z * Ro_z * r_z * g)/(u_z*H_tr))**(1/3)
print("A:", A)


''''''''''''''''''''''"ПІДПУНКТ 2"'''''''''''''''''''''''
print()
#ІНТЕРПОЛЮЄМО ВСІ ЗНАЧЕННЯ ПРИ t_kyp =  85.6 для розчину з х = 48%
print("ПОДВІЙНА ІНТЕРПОЛЯЦІЯ (А ні, одинарна) ПРИВІТ:    (для розчину)")


#Це якась реально p
half_life_p80 = 0.598 + (0.598-0.643) * (48-30)/18
half_life_p100 = 0.605 + (0.605-0.650) * (48-30)/18
half_life_p = half_life_p80 - (t_kyp - 80) * (half_life_p80 - half_life_p100) / 20
print("half_life_p80:", half_life_p80, "Вт/(м*К)")
print("half_life_p100:", half_life_p100, "Вт/(м*К)")
print("half_life_p:", half_life_p, "Вт/(м*К)")
print()

u_p60 = 0.55 + (0.55-0.52) * (48-30)/10
u_p70 = 0.5 + (0.5-0.47) * (48-30)/10
u_p = u_p70 + (u_p70 - u_p60) * (t_kyp - 70)/10
u_p = u_p / 1000
print("u_p60:", u_p60, "* 10^-3 Па*с")
print("u_p70:", u_p70, "* 10^-3 Па*с")
print("u_p:", u_p * 1000, "* 10^-3 Па*с")
print()

sigma_p = 75 + (75-73.6) * (48-20)/10
sigma_p = sigma_p / 1000
print("sigma_p:", sigma_p, "Н/м")

T_p = t_kyp + 273.15
print("T_p:", T_p)

#Тут я заплутався у величинах, але перераховувати вже лінь
Ro_p_p = 972 - (t_kyp - 80) * (972 - 965) / 10    #Ро розчину
print("Ro_p_p:", Ro_p_p, "кг/м3")


Ro_p = 0.3531 - (t_kyp - 85) * (0.3531 - 0.4229) / 5    #Ро пари
print("Ro_p:", Ro_p, "кг/м3")


b = 0.075 * (1+10*((Ro_p_p/Ro_p)-1)**(-2/3))
print("b:", b)


print("Тоді нарешті:")
B = b * ((half_life_p * half_life_p * Ro_p)/(u_p * sigma_p * T_p))**(1/3)
print("B:", B)
print()

b_st = 2 / 1000
r1 = r2 = 1 / 5800
half_life_st = 46.5

sum_rst = ( b_st / half_life_st) + r1 + r2
print("sum_rst:", sum_rst)
print()


#ДАЛІ ТРЕБА РОЗ'ЯЗАТИ РІВНЯННЯ
"ТУТ Я ЧИСТО ПЕРЕБОРОМ ЗНАХОДЖУ ЗНАЧЕННЯ q, ПРИ" \
"ЯКОМУ y=0"

y = -1
q = 0
while y < 0:
    q += 0.1
    y = (q**1.3 / A) + q * sum_rst + (q**0.33 / B) - delta_t_kor

print("q =", q)
print("При цьому q y =", y)


koef = q / delta_t_kor
print("koef k:", koef)


''''''''''''''''''''''''"ПУНКТ 6"''''''''''''''''''''''''

#Площа поверхні теплопередачі випарного апарата,
print("Q_rn", Q_rn, "Дж")
Q_rn = Q_rn / 3600      #Переводимо його у вати
print("Q_rn", Q_rn, "Вт")

F = Q_rn / (koef * delta_t_kor)
print("Наше фільне F =", F)

print()
print()
for i in range(10):
    print("Мої вітання, друже, це кінець!")